# Pandas Basic Tutorial

### Importing the pandas library

In [1]:
import pandas as pd             #importing pandas library and assign it to the varaible called pd

### Reading the CSV file

In [2]:
df=pd.read_csv("marks.csv")    #reading a csv file which is located in same working directory
df                             #displaying the dataframe

         Name  English  Maths  Tamil  Science  Total
0  Giridharan       90     95     91       97    373
1     Pradeep       80     80     80       80    320
2      Arvind       81     76     95      100    352
3   Srivatsan       85     86     97      100    368
4   Surendhar       89     76     90       91    346
5    Karthick       89     91     85       82    347

### Creating a dataframe

In [3]:
result={
    'Name': ['stud1','stud2','stud3'],
    'Results': ['P','P','P']
    }                           #declearing a dictionary with the columns names and its values
new_df=pd.DataFrame(result)     #converting the dictionary as a dataframe      
new_df                          #displaying the dataframe

    Name Results
0  stud1       P
1  stud2       P
2  stud3       P

### To find the shape of a dataframe

In [4]:
df.shape                  #(rows,cols)

(6, 6)

In [5]:
rows,cols=df.shape
rows

6

In [6]:
cols

6

### Head and Tail of a dataframe

In [7]:
df.head()              #display first 5 rows of a dataframe

         Name  English  Maths  Tamil  Science  Total
0  Giridharan       90     95     91       97    373
1     Pradeep       80     80     80       80    320
2      Arvind       81     76     95      100    352
3   Srivatsan       85     86     97      100    368
4   Surendhar       89     76     90       91    346

In [8]:
df.head(3)              #to display first n rows of a dataframe

         Name  English  Maths  Tamil  Science  Total
0  Giridharan       90     95     91       97    373
1     Pradeep       80     80     80       80    320
2      Arvind       81     76     95      100    352

In [9]:
df.tail()               #display last 5 rows of a dataframe

        Name  English  Maths  Tamil  Science  Total
1    Pradeep       80     80     80       80    320
2     Arvind       81     76     95      100    352
3  Srivatsan       85     86     97      100    368
4  Surendhar       89     76     90       91    346
5   Karthick       89     91     85       82    347

In [10]:
df.tail(3)                 #display last n rows of a dataframe

        Name  English  Maths  Tamil  Science  Total
3  Srivatsan       85     86     97      100    368
4  Surendhar       89     76     90       91    346
5   Karthick       89     91     85       82    347

### Indexing

In [11]:
df[2:5]                       #specific rows [start:end+1]

        Name  English  Maths  Tamil  Science  Total
2     Arvind       81     76     95      100    352
3  Srivatsan       85     86     97      100    368
4  Surendhar       89     76     90       91    346

In [12]:
df[["Name","Total"]]            #specific columns by their names

         Name  Total
0  Giridharan    373
1     Pradeep    320
2      Arvind    352
3   Srivatsan    368
4   Surendhar    346
5    Karthick    347

### Basic insights from the dataframe

In [13]:
df['Total'].max()                   #for maximum value

373

In [14]:
df['Total'].min()                   #for minimum value

320

In [15]:
df['Total'].mean()                   #for mean

351.0

In [16]:
df['Total'].std()                   #for standard deviation

18.846750383023593

In [17]:
df['Total'].sum()                   #for sum of all values

2106

In [18]:
df.describe()                        #for all basic info of a dataframe

         English      Maths      Tamil     Science      Total
count   6.000000   6.000000   6.000000    6.000000    6.00000
mean   85.666667  84.000000  89.666667   91.666667  351.00000
std     4.366539   7.974961   6.314006    8.914408   18.84675
min    80.000000  76.000000  80.000000   80.000000  320.00000
25%    82.000000  77.000000  86.250000   84.250000  346.25000
50%    87.000000  83.000000  90.500000   94.000000  349.50000
75%    89.000000  89.750000  94.000000   99.250000  364.00000
max    90.000000  95.000000  97.000000  100.000000  373.00000

### Conditional searching

In [19]:
df[df.Maths>=90]                           #data for students with maths mark greater than or equal to 90

         Name  English  Maths  Tamil  Science  Total
0  Giridharan       90     95     91       97    373
5    Karthick       89     91     85       82    347

In [20]:
df[['Name','Maths']][df.Maths==df.Maths.max()]     #Name and mark of the students who secured the highest mark in maths

         Name  Maths
0  Giridharan     95

### Changing the index

In [21]:
newdf = df.set_index('Name')                       #change the name col as index
newdf

            English  Maths  Tamil  Science  Total
Name
Giridharan       90     95     91       97    373
Pradeep          80     80     80       80    320
Arvind           81     76     95      100    352
Srivatsan        85     86     97      100    368
Surendhar        89     76     90       91    346
Karthick         89     91     85       82    347

In [22]:
newdf.loc['Giridharan']                         #loc used to locate an index

English     90
Maths       95
Tamil       91
Science     97
Total      373
Name: Giridharan, dtype: int64

In [23]:
df.loc[3]

Name       Srivatsan
English           85
Maths             86
Tamil             97
Science          100
Total            368
Name: 3, dtype: object

### Missing Value Handling

In [24]:
day=pd.read_csv('weather.csv',parse_dates=['date'])  #new dataframe is inserted in a variable called 'day' and you can find this dataset along with this file
day.set_index('date',inplace=True)               #changing the index as date and also inplace the change in the original dataset
day

            temperature  widespeed   event
date
2020-01-11         32.0        6.0    rain
2020-02-11          NaN        9.0   sunny
2020-03-11         28.0        NaN    snow
2020-04-11          NaN        7.0     NaN
2020-05-11         32.0        NaN    rain
2020-06-11          NaN        NaN   sunny
2020-07-11          NaN        NaN     NaN
2020-08-11         34.0        8.0  cloudy
2020-09-11         40.0       12.0   sunny

In [25]:
type(day.index[0])                 #since we used parse_dates attribute while reading our dataset, 
                                   #the data type of the date column was changed as timestamp if not it will be remained as str

pandas._libs.tslibs.timestamps.Timestamp

### Handling missing values are of three basic steps :
###### 1. fillna()
###### 2. dropna()
###### 3. interpolate to make a guess on missing values using interpolation

In [26]:
new_day=day.fillna(0)                                   #will replace all NaN values as 0
new_day

            temperature  widespeed   event
date
2020-01-11         32.0        6.0    rain
2020-02-11          0.0        9.0   sunny
2020-03-11         28.0        0.0    snow
2020-04-11          0.0        7.0       0
2020-05-11         32.0        0.0    rain
2020-06-11          0.0        0.0   sunny
2020-07-11          0.0        0.0       0
2020-08-11         34.0        8.0  cloudy
2020-09-11         40.0       12.0   sunny

In [27]:
new_day=day.fillna({
    'temperature':0,
    'widespeed':0,
    'event':'no event'
})                                      #replace NaN values of specific columns with specific values
new_day

            temperature  widespeed     event
date
2020-01-11         32.0        6.0      rain
2020-02-11          0.0        9.0     sunny
2020-03-11         28.0        0.0      snow
2020-04-11          0.0        7.0  no event
2020-05-11         32.0        0.0      rain
2020-06-11          0.0        0.0     sunny
2020-07-11          0.0        0.0  no event
2020-08-11         34.0        8.0    cloudy
2020-09-11         40.0       12.0     sunny

In [28]:
new_day=day.fillna(method='ffill')          #ffill(forward fill) method is to replace the NaN values with its next values
new_day

            temperature  widespeed   event
date
2020-01-11         32.0        6.0    rain
2020-02-11         32.0        9.0   sunny
2020-03-11         28.0        9.0    snow
2020-04-11         28.0        7.0    snow
2020-05-11         32.0        7.0    rain
2020-06-11         32.0        7.0   sunny
2020-07-11         32.0        7.0   sunny
2020-08-11         34.0        8.0  cloudy
2020-09-11         40.0       12.0   sunny

In [29]:
new_day=day.fillna(method='bfill')        #bfill(backward fill) method is to replace the NaN values with its previous values
new_day

            temperature  widespeed   event
date
2020-01-11         32.0        6.0    rain
2020-02-11         28.0        9.0   sunny
2020-03-11         28.0        7.0    snow
2020-04-11         32.0        7.0    rain
2020-05-11         32.0        8.0    rain
2020-06-11         34.0        8.0   sunny
2020-07-11         34.0        8.0  cloudy
2020-08-11         34.0        8.0  cloudy
2020-09-11         40.0       12.0   sunny

In [30]:
new_day=day.interpolate()      #interpolate helps us to guess an appropriate value with the help of its previous and next value
new_day

            temperature  widespeed   event
date
2020-01-11    32.000000       6.00    rain
2020-02-11    30.000000       9.00   sunny
2020-03-11    28.000000       8.00    snow
2020-04-11    30.000000       7.00     NaN
2020-05-11    32.000000       7.25    rain
2020-06-11    32.666667       7.50   sunny
2020-07-11    33.333333       7.75     NaN
2020-08-11    34.000000       8.00  cloudy
2020-09-11    40.000000      12.00   sunny

In [31]:
new_day=day.interpolate(method='time')    # method time will help us to guess a value by considering time as also a factor
new_day

            temperature  widespeed   event
date
2020-01-11    32.000000   6.000000    rain
2020-02-11    29.933333   9.000000   sunny
2020-03-11    28.000000   8.033333    snow
2020-04-11    30.032787   7.000000     NaN
2020-05-11    32.000000   7.245902    rain
2020-06-11    32.673913   7.500000   sunny
2020-07-11    33.326087   7.745902     NaN
2020-08-11    34.000000   8.000000  cloudy
2020-09-11    40.000000  12.000000   sunny

In [32]:
drop_day=day.dropna()                 #drop all the rows which has NaN values
drop_day

            temperature  widespeed   event
date
2020-01-11         32.0        6.0    rain
2020-08-11         34.0        8.0  cloudy
2020-09-11         40.0       12.0   sunny

In [33]:
drop_day=day.dropna(thresh=2)           #thres=n (threshold) parameter will remain the rows with atleast n non NaN values
drop_day

            temperature  widespeed   event
date
2020-01-11         32.0        6.0    rain
2020-02-11          NaN        9.0   sunny
2020-03-11         28.0        NaN    snow
2020-05-11         32.0        NaN    rain
2020-08-11         34.0        8.0  cloudy
2020-09-11         40.0       12.0   sunny

### Group By (split, apply, combine)

In [34]:
city=pd.read_csv('city_weather - Sheet1.csv', parse_dates=['date'])
city

         date      city  temperature  widespeed   event
0  2020-01-01  new york           32          6   sunny
1  2020-01-02  new york           36          7    snow
2  2020-01-03  new york           28         12   sunny
3  2020-01-04  new york           33         15   sunny
4  2020-01-01   chennai           41          8     fog
5  2020-01-02   chennai           38          9     fog
6  2020-01-03   chennai           30         14    rain
7  2020-01-04   chennai           35         10   sunny
8  2020-01-01     paris           28         11   sunny
9  2020-01-02     paris           26          9  cloudy
10 2020-01-03     paris           21          8  cloudy
11 2020-01-04     paris           29          6  cloudy

In [35]:
c=city.groupby('city')   #creating an object for data which waas grouped by a cites (split)
c

In [36]:
for cities, cities_df in c: #the object will looks like this internally
    print(cities)
    print(cities_df)

chennai
        date     city  temperature  widespeed  event
4 2020-01-01  chennai           41          8    fog
5 2020-01-02  chennai           38          9    fog
6 2020-01-03  chennai           30         14   rain
7 2020-01-04  chennai           35         10  sunny
new york
        date      city  temperature  widespeed  event
0 2020-01-01  new york           32          6  sunny
1 2020-01-02  new york           36          7   snow
2 2020-01-03  new york           28         12  sunny
3 2020-01-04  new york           33         15  sunny
paris
         date   city  temperature  widespeed   event
8  2020-01-01  paris           28         11   sunny
9  2020-01-02  paris           26          9  cloudy
10 2020-01-03  paris           21          8  cloudy
11 2020-01-04  paris           29          6  cloudy

In [37]:
c.get_group('chennai')   #accessing the object by city names

        date     city  temperature  widespeed  event
4 2020-01-01  chennai           41          8    fog
5 2020-01-02  chennai           38          9    fog
6 2020-01-03  chennai           30         14   rain
7 2020-01-04  chennai           35         10  sunny

In [39]:
c.get_group('chennai')[['date','temperature']].max()

date           2020-01-04 00:00:00
temperature                     41
dtype: object

In [40]:
c.max()  #applying the aggregate functions like mean(), sum(), max(), min(), etc for each groups (apply)
         #combining the resultant value as output (combine)

               date  temperature  widespeed  event
city
chennai  2020-01-04           41         14  sunny
new york 2020-01-04           36         15  sunny
paris    2020-01-04           29         11  sunny

### Concatination of dataframe

In [41]:
india=pd.DataFrame({
    'batsmen':['dhoni','virat','rohit'],
    'score':[50,45,30]
}
)
india       #dataframe 1 was created

  batsmen  score
0   dhoni     50
1   virat     45
2   rohit     30

In [42]:
aus=pd.DataFrame({
    'batsmen':['smith','warner','finch'],
    'score':[20,40,30]
}
)
aus       #dataframe 2 was created

  batsmen  score
0   smith     20
1  warner     40
2   finch     30

In [46]:
pd.concat([india,aus])  #concating two dataframes together but the indices was not in an order

  batsmen  score
0   dhoni     50
1   virat     45
2   rohit     30
0   smith     20
1  warner     40
2   finch     30

In [47]:
pd.concat([india,aus],ignore_index=True)   #by changing ignore_index as True will resolve this issue

  batsmen  score
0   dhoni     50
1   virat     45
2   rohit     30
3   smith     20
4  warner     40
5   finch     30

In [54]:
temp=pd.DataFrame({
    'cities':['chennai','delhi','mumbai'],
    'temperature':[32,30,33]
})
temp

    cities  temperature
0  chennai           32
1    delhi           30
2   mumbai           33

In [55]:
hum=pd.DataFrame({
    'humidity':[60,80,63]
})
hum

   humidity
0        60
1        80
2        63

In [56]:
pd.concat([temp,hum],axis=1)  #axis=1 will helps us to append a dataframe in column wise

    cities  temperature  humidity
0  chennai           32        60
1    delhi           30        80
2   mumbai           33        63

In [59]:
s=pd.Series(['rain','cloudy','sunny'],name='event')
s                                                         #creating a series of data to append

0      rain
1    cloudy
2     sunny
Name: event, dtype: object

In [60]:
pd.concat([temp,hum,s],axis=1)                          #not only dataframe, series can also be concatinated

    cities  temperature  humidity   event
0  chennai           32        60    rain
1    delhi           30        80  cloudy
2   mumbai           33        63   sunny

#### These are the basic operations in pandas. Plenty of operations were still there in pandas which we not yet covered. So explore, learn and practice them using small datasets. You can find various datasets in kaggle.com, download them and practice as much as you can. Because pandas will plays a vital role in feature engineering which we will come across later.

#               Thank you and I hope this was somehow useful for you.